FemDesign.Loads.SurfaceLoad
surface_load_type

FemDesign.Loads.SurfaceLoad.#ctor
Parameterless constructor for serialization.

FemDesign.Loads.SurfaceLoad.#ctor(FemDesign.Geometry.Region,FemDesign.Geometry.Vector3d,FemDesign.Loads.LoadCase,System.Boolean,System.String)
Uniform surface load
region:
load:
loadCase:
loadProjection: False: Intensity meant along action line (eg. dead load). True: Intensity meant perpendicular to direction of load (eg. snow load).
comment:

FemDesign.Loads.SurfaceLoad.#ctor(FemDesign.Geometry.Region,System.Collections.Generic.List{FemDesign.Loads.LoadLocationValue},FemDesign.Geometry.Vector3d,FemDesign.Loads.LoadCase,System.Boolean,System.String)
Variable surface load

FemDesign.Loads.SurfaceLoad.Uniform(FemDesign.Geometry.Region,FemDesign.Geometry.Vector3d,FemDesign.Loads.LoadCase,System.Boolean,System.String)
Create uniform SurfaceLoad
region:
force:
loadCase:
loadProjection: False: Intensity meant along action line (eg. dead load). True: Intensity meant perpendicular to direction of load (eg. snow load).
comment:
Returns:

FemDesign.Loads.SurfaceLoad.Variable(FemDesign.Geometry.Region,FemDesign.Geometry.Vector3d,System.Collections.Generic.List{FemDesign.Loads.LoadLocationValue},FemDesign.Loads.LoadCase,System.Boolean,System.String)
Create variable SurfaceLoad
region:
direction:
loadLocationValue:
loadCase:
loadProjection: False: Intensity meant along action line (eg. dead load). True: Intensity meant perpendicular to direction of load (eg. snow load).
comment:
Returns: